app/Controllers/Menu.php

    public function add_user()
    {

        $data['user'] = $this->model->orderBy('id', 'asc')->findAll();
---
SELECT *
FROM `user`
ORDER BY `id` ASC

    public function participant()
    {

        $data['student'] = $this->model->orderBy('id')->findAll();
---
SELECT *
FROM `student`
ORDER BY `id`