app/Models/Model_Auth.php

SELECT *
FROM `student`
WHERE `nama` = 'MUHAMMAD JEFRY MULYANTO'
AND `email` = 'mhmmadjfry015@gmail.com'
AND `perusahaan` = 'Leap Surabaya'
AND `jenis_k` = 'Pria'
---
    public function login_student($nama, $email, $perusahaan, $jenis_k)
    {
        return $this->db->table($this->tableStudent)->where([
            'nama' => $nama,
            'email' => $email,
            'perusahaan' => $perusahaan,
            'jenis_k' => $jenis_k,
        ])->get()->getRowArray();